#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.snowflake_resources.snowflake_database_role.owner will be created
  + resource "snowflake_database_role" "owner" {
      + database             = "PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PROD_FIRST_O"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database_role.read will be created
  + resource "snowflake_database_role" "read" {
      + database             = "PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PROD_FIRST_R"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database_role.read_write will be created
  + resource "snowflake_database_role" "read_write" {
      + database             = "PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PROD_FIRST_RW"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_grant_database_role.o_inherits_rw will be created
  + resource "snowflake_grant_database_role" "o_inherits_rw" {
      + database_role_name        = "\"PROD\".\"ROLE_PROD_FIRST_O\""
      + id                        = (known after apply)
      + parent_database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_RW\""
    }

  # module.snowflake_resources.snowflake_grant_database_role.rw_inherits_r will be created
  + resource "snowflake_grant_database_role" "rw_inherits_r" {
      + database_role_name        = "\"PROD\".\"ROLE_PROD_FIRST_RW\""
      + id                        = (known after apply)
      + parent_database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_all_dynamic_tables will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_all_dynamic_tables" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "DYNAMIC TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_all_materialized_views will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_all_materialized_views" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "MATERIALIZED VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_all_tables will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_all_tables" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_all_views will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_all_views" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_future_dynamic_tables will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_future_dynamic_tables" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "DYNAMIC TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_future_materialized_views will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_future_materialized_views" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "MATERIALIZED VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_future_tables will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_future_tables" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_future_views will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_future_views" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_usage_on_all_functions will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_usage_on_all_functions" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_usage_on_all_procedures will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_usage_on_all_procedures" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_usage_on_all_sequences will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_usage_on_all_sequences" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_usage_on_future_functions will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_usage_on_future_functions" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_usage_on_future_procedures will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_usage_on_future_procedures" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_usage_on_future_sequences will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_usage_on_future_sequences" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.usage_to_r will be created
  + resource "snowflake_grant_privileges_to_database_role" "usage_to_r" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "\"PROD\".\"FIRST\""
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Abhinandan90, Action: `pull_request`*